#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation Success! The configuration is valid.


#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.prod.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/ProdMemos]
module.dev.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos]
module.stage.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/StageMemos]
module.prod.azurerm_app_service_plan.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/ProdMemos/providers/Microsoft.Web/serverfarms/prodmemos-asp]
module.dev.azurerm_app_service_plan.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/serverfarms/devmemos-asp]
module.stage.azurerm_app_service_plan.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/StageMemos/providers/Microsoft.Web/serverfarms/stagememos-asp]
module.dev.azurerm_app_service.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/sites/devmemos]
module.prod.azurerm_app_service.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/ProdMemos/providers/Microsoft.Web/sites/prodmemos]
module.stage.azurerm_app_service.this: Refreshing state... [id=/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/StageMemos/providers/Microsoft.Web/sites/stagememos]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.dev.azurerm_app_service.this will be updated in-place
  ~ resource "azurerm_app_service" "this" {
        app_service_plan_id            = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/serverfarms/devmemos-asp"
      ~ app_settings                   = {
            "AppSettings__Environment"        = "Dev"
          ~ "ConnectionStrings__MainDatabase" = "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;" -> "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=BrxDuspXnSqfLQWkL4KEfd6aWbxSsZZX;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;"
        }
        client_affinity_enabled        = false
        client_cert_enabled            = false
        default_site_hostname          = "devmemos.azurewebsites.net"
        enabled                        = true
        https_only                     = false
        id                             = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/DevMemos/providers/Microsoft.Web/sites/devmemos"
        location                       = "westus2"
        name                           = "devmemos"
        outbound_ip_addresses          = "13.66.138.102,51.143.17.179,20.190.41.114,13.66.215.29,52.247.205.127"
        possible_outbound_ip_addresses = "13.66.138.102,51.143.17.179,20.190.41.114,13.66.215.29,52.247.205.127,51.143.19.29,13.66.213.237,13.77.182.110,52.250.112.28,13.66.213.54"
        resource_group_name            = "DevMemos"
        site_credential                = [
            {
                password = "Ql2gvR2Gv752gbffHfu4rxrfHYprWxT8CKfYD8J5hh748chlifEq8bEiqakC"
                username = "$devmemos"
            },
        ]
        source_control                 = [
            {
                branch   = "master"
                repo_url = ""
            },
        ]
        tags                           = {
            "environment" = "Dev"
        }

        auth_settings {
            additional_login_params        = {}
            allowed_external_redirect_urls = []
            enabled                        = false
            token_refresh_extension_hours  = 0
            token_store_enabled            = false
        }

        logs {
            application_logs {
            }

            http_logs {
            }
        }

        site_config {
            always_on                   = false
            default_documents           = [
                "Default.htm",
                "Default.html",
                "Default.asp",
                "index.htm",
                "index.html",
                "iisstart.htm",
                "default.aspx",
                "index.php",
                "hostingstart.html",
            ]
            dotnet_framework_version    = "v4.0"
            ftps_state                  = "AllAllowed"
            http2_enabled               = false
            ip_restriction              = []
            local_mysql_enabled         = false
            managed_pipeline_mode       = "Integrated"
            min_tls_version             = "1.2"
            php_version                 = "5.6"
            remote_debugging_enabled    = false
            scm_ip_restriction          = []
            scm_type                    = "None"
            scm_use_main_ip_restriction = false
            use_32_bit_worker_process   = true
            websockets_enabled          = false
        }
    }

  # module.dev.azurerm_sql_database.this will be created
  + resource "azurerm_sql_database" "this" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = "Basic"
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westus2"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "memos"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = "Basic"
      + resource_group_name              = "DevMemos"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "devmemos-sqlsvr"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "production"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.dev.azurerm_sql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_sql_firewall_rule" "allow_azure_services" {
      + end_ip_address      = "0.0.0.0"
      + id                  = (known after apply)
      + name                = "AllowAzureServices"
      + resource_group_name = "DevMemos"
      + server_name         = "devmemos-sqlsvr"
      + start_ip_address    = "0.0.0.0"
    }

  # module.dev.azurerm_sql_server.this will be created
  + resource "azurerm_sql_server" "this" {
      + administrator_login          = "dbadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westus2"
      + name                         = "devmemos-sqlsvr"
      + resource_group_name          = "DevMemos"
      + tags                         = {
          + "environment" = "Dev"
        }
      + version                      = "12.0"
    }

  # module.prod.azurerm_app_service.this will be updated in-place
  ~ resource "azurerm_app_service" "this" {
        app_service_plan_id            = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/ProdMemos/providers/Microsoft.Web/serverfarms/prodmemos-asp"
      ~ app_settings                   = {
            "AppSettings__Environment"        = "Prod"
          ~ "ConnectionStrings__MainDatabase" = "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;" -> "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=BrxDuspXnSqfLQWkL4KEfd6aWbxSsZZX;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;"
        }
        client_affinity_enabled        = false
        client_cert_enabled            = false
        default_site_hostname          = "prodmemos.azurewebsites.net"
        enabled                        = true
        https_only                     = false
        id                             = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/ProdMemos/providers/Microsoft.Web/sites/prodmemos"
        location                       = "westus2"
        name                           = "prodmemos"
        outbound_ip_addresses          = "20.190.0.233,20.190.1.8,20.190.1.21,20.190.1.32,20.190.1.42,20.190.1.61,20.190.1.217,20.190.2.43,20.190.2.66"
        possible_outbound_ip_addresses = "20.190.0.233,20.190.1.8,20.190.1.21,20.190.1.32,20.190.1.42,20.190.1.61,20.190.1.217,20.190.2.43,20.190.2.66,20.190.1.72,20.190.0.33,20.190.1.162,20.190.1.177,20.190.1.187,20.190.1.191"
        resource_group_name            = "ProdMemos"
        site_credential                = [
            {
                password = "GRezv0CzEHs4dSbZK1F3PjqgsTHdz67Z6qNdkwczNrcqLwpu0erZ40jGFGRk"
                username = "$prodmemos"
            },
        ]
        source_control                 = [
            {
                branch   = "master"
                repo_url = ""
            },
        ]
        tags                           = {
            "environment" = "Prod"
        }

        auth_settings {
            additional_login_params        = {}
            allowed_external_redirect_urls = []
            enabled                        = false
            token_refresh_extension_hours  = 0
            token_store_enabled            = false
        }

        logs {
            application_logs {
            }

            http_logs {
            }
        }

        site_config {
            always_on                   = false
            default_documents           = [
                "Default.htm",
                "Default.html",
                "Default.asp",
                "index.htm",
                "index.html",
                "iisstart.htm",
                "default.aspx",
                "index.php",
                "hostingstart.html",
            ]
            dotnet_framework_version    = "v4.0"
            ftps_state                  = "AllAllowed"
            http2_enabled               = false
            ip_restriction              = []
            local_mysql_enabled         = false
            managed_pipeline_mode       = "Integrated"
            min_tls_version             = "1.2"
            php_version                 = "5.6"
            remote_debugging_enabled    = false
            scm_ip_restriction          = []
            scm_type                    = "None"
            scm_use_main_ip_restriction = false
            use_32_bit_worker_process   = true
            websockets_enabled          = false
        }
    }

  # module.prod.azurerm_sql_database.this will be created
  + resource "azurerm_sql_database" "this" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = "Basic"
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westus2"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "memos"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = "Basic"
      + resource_group_name              = "ProdMemos"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "prodmemos-sqlsvr"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "production"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.prod.azurerm_sql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_sql_firewall_rule" "allow_azure_services" {
      + end_ip_address      = "0.0.0.0"
      + id                  = (known after apply)
      + name                = "AllowAzureServices"
      + resource_group_name = "ProdMemos"
      + server_name         = "prodmemos-sqlsvr"
      + start_ip_address    = "0.0.0.0"
    }

  # module.prod.azurerm_sql_server.this will be created
  + resource "azurerm_sql_server" "this" {
      + administrator_login          = "dbadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westus2"
      + name                         = "prodmemos-sqlsvr"
      + resource_group_name          = "ProdMemos"
      + tags                         = {
          + "environment" = "Prod"
        }
      + version                      = "12.0"
    }

  # module.stage.azurerm_app_service.this will be updated in-place
  ~ resource "azurerm_app_service" "this" {
        app_service_plan_id            = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/StageMemos/providers/Microsoft.Web/serverfarms/stagememos-asp"
      ~ app_settings                   = {
            "AppSettings__Environment"        = "Stage"
          ~ "ConnectionStrings__MainDatabase" = "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;" -> "Server=tcp:devmemos-sqlsvr.database.windows.net,1433;Initial Catalog=memos;Persist Security Info=False;User ID=dbadmin;Password=BrxDuspXnSqfLQWkL4KEfd6aWbxSsZZX;MultipleActiveResultSets=False;Encrypt=True;TrustServerCertificate=False;Connection Timeout=30;"
        }
        client_affinity_enabled        = false
        client_cert_enabled            = false
        default_site_hostname          = "stagememos.azurewebsites.net"
        enabled                        = true
        https_only                     = false
        id                             = "/subscriptions/d8ddafcc-d7ae-47c1-88b4-094280467240/resourceGroups/StageMemos/providers/Microsoft.Web/sites/stagememos"
        location                       = "westus2"
        name                           = "stagememos"
        outbound_ip_addresses          = "13.66.138.107,51.141.163.40,51.141.161.233,52.247.221.19,52.250.109.61"
        possible_outbound_ip_addresses = "13.66.138.107,51.141.163.40,51.141.161.233,52.247.221.19,52.250.109.61,51.143.93.210,51.141.162.107,51.143.91.207,51.143.90.23,52.250.104.39"
        resource_group_name            = "StageMemos"
        site_credential                = [
            {
                password = "SadM3s2lFgprCH4FmJZwN0nf07j5Czf1lGdmqpcJX7aWhBuZlGpqmYlNEmHB"
                username = "$stagememos"
            },
        ]
        source_control                 = [
            {
                branch   = "master"
                repo_url = ""
            },
        ]
        tags                           = {
            "environment" = "Stage"
        }

        auth_settings {
            additional_login_params        = {}
            allowed_external_redirect_urls = []
            enabled                        = false
            token_refresh_extension_hours  = 0
            token_store_enabled            = false
        }

        logs {
            application_logs {
            }

            http_logs {
            }
        }

        site_config {
            always_on                   = false
            default_documents           = [
                "Default.htm",
                "Default.html",
                "Default.asp",
                "index.htm",
                "index.html",
                "iisstart.htm",
                "default.aspx",
                "index.php",
                "hostingstart.html",
            ]
            dotnet_framework_version    = "v4.0"
            ftps_state                  = "AllAllowed"
            http2_enabled               = false
            ip_restriction              = []
            local_mysql_enabled         = false
            managed_pipeline_mode       = "Integrated"
            min_tls_version             = "1.2"
            php_version                 = "5.6"
            remote_debugging_enabled    = false
            scm_ip_restriction          = []
            scm_type                    = "None"
            scm_use_main_ip_restriction = false
            use_32_bit_worker_process   = true
            websockets_enabled          = false
        }
    }

  # module.stage.azurerm_sql_database.this will be created
  + resource "azurerm_sql_database" "this" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = "Basic"
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westus2"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "memos"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = "Basic"
      + resource_group_name              = "StageMemos"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "stagememos-sqlsvr"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)
      + tags                             = {
          + "environment" = "production"
        }

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.stage.azurerm_sql_firewall_rule.allow_azure_services will be created
  + resource "azurerm_sql_firewall_rule" "allow_azure_services" {
      + end_ip_address      = "0.0.0.0"
      + id                  = (known after apply)
      + name                = "AllowAzureServices"
      + resource_group_name = "StageMemos"
      + server_name         = "stagememos-sqlsvr"
      + start_ip_address    = "0.0.0.0"
    }

  # module.stage.azurerm_sql_server.this will be created
  + resource "azurerm_sql_server" "this" {
      + administrator_login          = "dbadmin"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westus2"
      + name                         = "stagememos-sqlsvr"
      + resource_group_name          = "StageMemos"
      + tags                         = {
          + "environment" = "Stage"
        }
      + version                      = "12.0"
    }

Plan: 9 to add, 3 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

```

</details>

*Pusher: @Sheludchenko, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure`*